ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_adc.c
/*********************************************************************************************************//**
 * @brief Get the internal voltage reference calibration value.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @retval The internal voltage reference calibration value between 0 and 0x7F
 ************************************************************************************************************/
u8 ADC_GetVoltageReferenceValue(HT_ADC_TypeDef* HT_ADCn)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  return (u8)(HT_ADCn->VREFVALR & ADC_VREFVALR_MASK);
}
#endif

#if (LIBCFG_ADC_MVDDA)
/*********************************************************************************************************//**
 * @brief Enable or Disable the power of MVDDA (VDDA/2)
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_MVDDACmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_ADCn->VREFCR |= ADC_VREF_MVDDAEN;
  }
  else
  {
    HT_ADCn->VREFCR &= ~(ADC_VREF_MVDDAEN);
  }
}
#endif

#if (LIBCFG_ADC_TEMP_SENSOR)
/*********************************************************************************************************//**
 * @brief Enable or Disable the Temperature Sensor of specified ADC.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_TempSensorCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Enable Temperature Sensor                                                                              */
  if (NewState != DISABLE)
  {
    HT_ADCn->TSCR |= ADC_TEMP_SENSOR_ENABLE;
  }
  else
  {
    HT_ADCn->TSCR &= ~ADC_TEMP_SENSOR_ENABLE;
  }
}

/*********************************************************************************************************//**
 * @brief This function is used to set the Temperature Sensor clock divider.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param TempSensorClockDiv: specify the value of the TSCLK(PCK) divider as the clock source for the
 *        temperature sensor.
 * @retval None
 * @note  The TempSensorClockDiv range and optimal operation frequency, please refer to the electrical
          characteristics section of the device datasheet.
 ************************************************************************************************************/
void ADC_TempSensorSetClockDivider(HT_ADC_TypeDef* HT_ADCn, u8 TempSensorClockDiv)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_TEMP_SENSOR_DIV(TempSensorClockDiv));

  HT_ADCn->TSCR = (HT_ADCn->TSCR & (~0xF0UL)) | (TempSensorClockDiv << 4);
}

/*********************************************************************************************************//**
 * @brief This function is used to set the Temperature Sensor start to operate.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 * @note  This control bit will automatically be reset by the hardware once the temperature sensor's process
          is complete.
 ************************************************************************************************************/
void ADC_TempSensorStartOperateCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  /* Start to operate                                                                                       */
  if (NewState != DISABLE)
  {
    HT_ADCn->TSCR |= ADC_TEMP_SENSOR_START_OPERATE;
  }
  else
  {
    HT_ADCn->TSCR &= ~ADC_TEMP_SENSOR_START_OPERATE;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specified Temperature Sensor flag has been set.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param TempSensorFlag: Specify the flag to check.
 *   This parameter can be one of the following values:
 *     @arg TEMP_SENSOR_FLAG_READY : The temperature sensor status is ready to measure with ADC.
 *          Note:The TEMP_SENSOR_FLAG_READY is only keep the 256 clock periods of TSCLK then hardware auto
 *          time-out to reset.
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus ADC_TempSensorGetFlagStatus(HT_ADC_TypeDef* HT_ADCn, u32 TempSensorFlag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_TEMP_SENSOR_FLAG(TempSensorFlag));

  if ((HT_ADCn->TSCR & TempSensorFlag) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear the specified Temperature Sensor flag.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param TempSensorFlag: Specify the flag to check.
 *   This parameter can be one of the following values:
 *     @arg TEMP_SENSOR_FLAG_READY : The temperature sensor status is ready to measure with ADC.
 *          Note:The TEMP_SENSOR_FLAG_READY is only keep the 256 clock periods of TSCLK then hardware auto
 *          time-out to reset.
 * @retval None
 ************************************************************************************************************/
void ADC_TempSensorClearFlag(HT_ADC_TypeDef* HT_ADCn, u32 TempSensorFlag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_TEMP_SENSOR_FLAG(TempSensorFlag));

  HT_ADCn->TSCR &= ~TempSensorFlag;
}

