ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/src/ht32l5xxxx_adc.c
/*********************************************************************************************************//**
 * @brief Get the calibration values of the Temperature Sensor.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @retval Return the temperature sensor calibration value.
 ************************************************************************************************************/
u16 ADC_TempSensorGetCalValue(HT_ADC_TypeDef* HT_ADCn)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  return HT_ADCn->TSCALR & ADC_MASK_TSCAL;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified Temperature Sensor interrupts.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param ADC_INT_TP_x: Specify the temperature sensor interrupt sources that is to be enabled or disabled.
 *   This parameter can be the following values:
 *     @arg TEMP_SENSOR_INT_READY        :
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_TempSensorIntConfig(HT_ADC_TypeDef* HT_ADCn, u32 ADC_INT_TP_x, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_TEMP_SENSOR_INT(ADC_INT_TP_x));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_ADCn->TSCR |= ADC_INT_TP_x;
  }
  else
  {
    HT_ADCn->TSCR &= ~ADC_INT_TP_x;
  }
}

/*********************************************************************************************************//**
 * @brief Get the temperature. (Unit: 0.001 Celsius)
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param tempPara:  pointer to a ADC_TempSensorParam_TypeDef structure.
 *   - Advrefp_mV: The reference voltage of ADVREFP in millivolts.
 *   - TsData: The digital value output by the temperature sensor converted by the ADC.
 *   - CalTempPoint_mC: The calibration temperature point in milli-degree Celsius
 * @param temperature_mC: the actual temperature and it is one thousandth degree Celsius.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus ADC_TempSensorGetTemp(HT_ADC_TypeDef* HT_ADCn, ADC_TempSensorParam_TypeDef* tempPara ,s32* temperature_mC)
{
  u32 ts_calib_vol;   /* The temperature sensor calibration voltage value that is converted from TSCALR     */
  u32 ts_data_vol;    /* The actual temperature sensor output voltage value                                 */

  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));

  if (tempPara->TsData > 0xFFF)
  {
    return ERROR;
  }

  if (tempPara->Advrefp_mV > LIBCFG_MAX_VREF_VOL)
  {
    return ERROR;
  }

  /* Calculate the temperature sensor calibration voltage value.                                            */
  /* Note: Multiplying the calculation result by 100 is to scale down the unit to convert to 10uV, avoiding */
  /*       floating-point arithmetic later on.                                                              */
  ts_calib_vol = (ADC_TempSensorGetCalValue(HT_ADCn) * LIBCFG_ADC_TEMP_SENSOR_CALIBRATION_ADVREFP * 100) >> 12;

  /* Calculate the actual temperature sensor output voltage value.                                          */
  /* Note: Multiplying the calculation result by 100 is to scale down the unit to convert to 10uV, avoiding */
  /*       floating-point arithmetic later on.                                                              */
  ts_data_vol  = (tempPara->TsData  * tempPara->Advrefp_mV * 100) >> 12;

  /* Calculate the actual temperature.                                                                      */
  *temperature_mC = (s32)(((s32)(ts_calib_vol - ts_data_vol) * 1000) / LIBCFG_ADC_TEMP_SENSOR_AVG_SLOPE +
                    tempPara->CalTempPoint_mC);
  return SUCCESS;
}

/*********************************************************************************************************//**
 * @brief Get the calibration temperature point of the Temperature Sensor.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @retval Return the temperature calibration reference temperature (Unit: 0.001 Celsius).
 * @note The calibration temperature point can be defined by user selection via the ADC_CAL_TEMP_POINT_SOURCE.
 *   - 0: A fixed default temperature is used.
 *     !!! NOTICE !!! The fixed default temperature is calibrated under specific production test conditions,
 *     which represent the environment of that batch only. The actual calibration temperature may slightly
 *     between production lots.
 *   - 1: The value is derived from the factory trim code.
 ************************************************************************************************************/
s32 ADC_TempSensorGetCalTempPoint(HT_ADC_TypeDef* HT_ADCn)
{
  /* Check the parameters                                                                                    */
  Assert_Param(IS_ADC(HT_ADCn));
  #if ADC_CAL_TEMP_POINT_SORUCE
  /* Get calibration temperature point from factory trim code                                                */
  /* To Do... */
   #error "Trim code feature is not yet implemented."
  #else
  /* Return fixed default calibration temperature point                                                      */
  HT_ADCn->TSCALR; /* Used only to avoid "unused parameter" compiler warning.                                */
  return  ADC_FIXED_CAL_TEMP_mC;
  #endif
}
#endif

/*********************************************************************************************************//**
 * @brief Enable or Disable the ADC low voltage mode (ADCLVM). The ADCLVM can be set when the power supply
          VDDA of the A/D converter is below 2.5 V. It will help the ADC to keep the balance between the
          performance and power consumption.
 * @param HT_ADCn: where HT_ADCn is the selected ADC from the ADC peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_LowVoltageModeCmd(HT_ADC_TypeDef* HT_ADCn, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_ADC(HT_ADCn));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    HT_ADCn->CR |= ADC_LVM_BIT;
  }
  else
  {
    HT_ADCn->CR &= ~(ADC_LVM_BIT);
  }
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
